Repository: MostafaKader56/flutter_spark_systems_task
Catalog: lib/l10n/intl_*.arb
Languages: ar

# onboarding_start_app
source: Let's Go
ar: لنبدأ

# onboarding_start_next
source: Next
ar: التالي

# other_lang
source: العربية
ar: English

# onboarding_1_title
source: ✨ Welcome to Sparkle Systems Task! 💫
ar: ✨ مرحباً بك في مهمة Sparkle Systems! 💫

# onboarding_1_description
source: Get ready to dive into the most fun and sparkling task you’ve ever had! 🌟 Let's make data analysis shine and sparkle ✨ like never before! 💼💎
ar: استعد للغوص في أمتع مهمة مليئة باللمعان والتألق! 🌟 دعنا نجعل تحليل البيانات يلمع ويتألق ✨ كما لم يحدث من قبل! 💼💎

# onboarding_2_title
source: 🔍 Unveil Data Secrets! 📊
ar: 🔍 اكتشف أسرار البيانات! 📊

# onboarding_2_description
source: Crunching numbers? 🧮 Yes, please! Dive into the data, group it by months, and watch the magic happen! ✨ Your task just got more fun with every click! 💥💻
ar: تحليل الأرقام؟ 🧮 نعم، بالتأكيد! استكشف البيانات، قسمها حسب الأشهر، وشاهد السحر يحدث! ✨ مهمتك أصبحت أكثر متعة مع كل نقرة! 💥💻

# onboarding_3_title
source: 📅 Set Up Your Metrics like a Pro! 📈
ar: 📅 قم بإعداد مؤشرات الأداء مثل المحترفين! 📈

# onboarding_3_description
source: Get those key metrics ready—total orders, average sales, and returns. 💡 You’re the mastermind behind the numbers! 💪 Let’s make it as smooth as a sparkle! ✨
ar: جهز مؤشرات الأداء الرئيسية—إجمالي الطلبات، متوسط المبيعات، والمرتجعات. 💡 أنت العقل المدبر وراء هذه الأرقام! 💪 دعنا نجعلها سلسة ومشرقة مثل اللمعان! ✨

# onboarding_4_title
source: ⚡ Create a Sparkling Graph! 📉
ar: ⚡ أنشئ رسماً بيانياً مذهلاً! 📉

# onboarding_4_description
source: Show the data like a pro! 📊 Use that graph to visualize the months and orders—let’s get that X and Y axis to dazzle! ✨ A chart with some serious sparkle! ✨
ar: اعرض البيانات مثل المحترفين! 📊 استخدم الرسم البياني لتصور الأشهر والطلبات—دعنا نجعل المحورين X و Y يبرقان! ✨ رسم بياني بلمسة احترافية! ✨

# onboarding_5_title
source: 🎉 It’s All About the Sparkle! 💎
ar: 🎉 الأمر كله يتعلق بالتألق! 💎

# onboarding_5_description
source: Now that you’ve mastered the data, let’s share the sparkle with the world! 🌍 Send it off with pride—because this task? It’s nothing short of a masterpiece! 🏆
ar: الآن بعد أن أتقنت البيانات، شارك هذا التألق مع العالم! 🌍 أرسلها بكل فخر—لأن هذه المهمة؟ إنها تحفة فنية بلا شك! 🏆

source: All orders
ar: كل الطلبات

source: Active orders
ar: الطلبات النشطة

source: Ordered orders
ar: الطلبات المطلوبة

source: Delivered orders
ar: الطلبات المُسلَّمة

source: Returned orders
ar: الطلبات المُرجعة

source: Something went wrong
ar: حدث خطأ ما

source: Retry
ar: إعادة المحاولة

# home_title
source: Order Analytics
ar: تحليل الطلبات

# home_subtitle
source: View insights about customer orders
ar: عرض رؤى حول طلبات العملاء

# home_note
source: Note: the chart is horizentally scrollable.
ar: ملحوظة: الرسم البياني قابل للتمرير أفقيًا.
